In [77]:
import pandas as pd

In [78]:
pd.__version__

'2.0.1'

In [79]:
my_details={
    'name':['Uday Vikram Singh','Anubhav Yadav','Prakhar Nigam','Anand Kumar','Ravi Mishra'],
    'age':[20,21,21,23,21],
    'Degree':['B.Tech(CSE)','B.Tech(Chemical)','B.Tech(Cyber Security)','B.Arch','Nursing'],
    'College':['SRMCEM','IET','Chandigarh University','SDCA',None],
    'Location':['Lucknow','Lucknow','Chandigarh','Ghaziabad','Lucknow'],
}

In [80]:
print(my_details)

{'name': ['Uday Vikram Singh', 'Anubhav Yadav', 'Prakhar Nigam', 'Anand Kumar', 'Ravi Mishra'], 'age': [20, 21, 21, 23, 21], 'Degree': ['B.Tech(CSE)', 'B.Tech(Chemical)', 'B.Tech(Cyber Security)', 'B.Arch', 'Nursing'], 'College': ['SRMCEM', 'IET', 'Chandigarh University', 'SDCA', None], 'Location': ['Lucknow', 'Lucknow', 'Chandigarh', 'Ghaziabad', 'Lucknow']}

In [81]:
my_df=pd.DataFrame(my_details,index=('A','B','C','D','E'))
print(my_df)

                name  age                  Degree                College
A  Uday Vikram Singh   20             B.Tech(CSE)                 SRMCEM  \
B      Anubhav Yadav   21        B.Tech(Chemical)                    IET
C      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh University
D        Anand Kumar   23                  B.Arch                   SDCA
E        Ravi Mishra   21                 Nursing                   None

     Location
A     Lucknow
B     Lucknow
C  Chandigarh
D   Ghaziabad
E     Lucknow

# Data Access

In [82]:
my_df.head() # first five rows

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [83]:
my_df.tail() # last five columns

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [84]:
my_df.index # it is a series of labels that identify each row, used for label-based access and alignments

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [85]:
my_df

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [86]:
my_df.index=['a','b','c','d','e']

In [87]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [88]:
# accessing information using index
my_df.loc['e']

name        Ravi Mishra
age                  21
Degree          Nursing
College            None
Location        Lucknow
Name: e, dtype: object

# Data Cleaning

In [89]:
my_df.isnull() # used for checking missing values, checks whether value is null or not, True on e's college

    name    age  Degree  College  Location
a  False  False   False    False     False
b  False  False   False    False     False
c  False  False   False    False     False
d  False  False   False    False     False
e  False  False   False     True     False

In [90]:
my_df.notnull() # used for checking missing values, check whether value is not null or not, False on e's college

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [91]:
my_df.notna() # used for checking missing values

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [92]:
my_df.dropna() # Removes row with missing values, by default axis=0 --> rows

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad

In [93]:
my_df.dropna(axis=1) # On using axis=1 Removes column with missing values
# my_df.dropna(axis=1,inplace=True) # On using inplace=True changes are reflected in Original Dataframe too

                name  age                  Degree    Location
a  Uday Vikram Singh   20             B.Tech(CSE)     Lucknow
b      Anubhav Yadav   21        B.Tech(Chemical)     Lucknow
c      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh
d        Anand Kumar   23                  B.Arch   Ghaziabad
e        Ravi Mishra   21                 Nursing     Lucknow

In [94]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [95]:
my_df.fillna('Integral University',inplace=True) # replace missing values with specified values

In [96]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [97]:
my_df.duplicated() # return a boolean series indicating whether each row in dataframe is duplicated or not .

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [98]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [99]:
my_df.drop_duplicates() # removes duplicate rows from the dataframe

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

# Data Selection and Indexing

In [100]:
# Selection by Label
print(my_df.loc['a'])
print(my_df.loc['c'])

name        Uday Vikram Singh
age                        20
Degree            B.Tech(CSE)
College                SRMCEM
Location              Lucknow
Name: a, dtype: object
name                 Prakhar Nigam
age                             21
Degree      B.Tech(Cyber Security)
College      Chandigarh University
Location                Chandigarh
Name: c, dtype: object

In [101]:
# Selection By position
print(my_df.iloc[0])
print(my_df.iloc[1])
print(my_df.iloc[4])

name        Uday Vikram Singh
age                        20
Degree            B.Tech(CSE)
College                SRMCEM
Location              Lucknow
Name: a, dtype: object
name           Anubhav Yadav
age                       21
Degree      B.Tech(Chemical)
College                  IET
Location             Lucknow
Name: b, dtype: object
name                Ravi Mishra
age                          21
Degree                  Nursing
College     Integral University
Location                Lucknow
Name: e, dtype: object

In [102]:
# Boolean Indexing - It is a technique used in Pandas to select the subset of data based on certain conditions. It allows 
# you to filter rows or columns from dataframe using Boolean arrays.
condition=my_df['age']>20
print(condition)
my_df[condition]

a    False
b     True
c     True
d     True
e     True
Name: age, dtype: bool

,name,age,Degree,College,Location
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [103]:
condition2=my_df['name']
print(condition2)
names=[name for name in condition2 if name[0]=='A']
print(names)

a    Uday Vikram Singh
b        Anubhav Yadav
c        Prakhar Nigam
d          Anand Kumar
e          Ravi Mishra
Name: name, dtype: object
['Anubhav Yadav', 'Anand Kumar']

In [104]:
condition3=my_df['Location']=='Lucknow'
print(condition3)
my_df[condition3]

a     True
b     True
c    False
d    False
e     True
Name: Location, dtype: bool

                name  age            Degree              College Location
a  Uday Vikram Singh   20       B.Tech(CSE)               SRMCEM  Lucknow
b      Anubhav Yadav   21  B.Tech(Chemical)                  IET  Lucknow
e        Ravi Mishra   21           Nursing  Integral University  Lucknow

# Data Transformation

In [105]:
# apply() - Apply a function to each element or row/column
# 0 or index: apply function to each column.
# 1 or columns: apply function to each row.

In [106]:
import numpy as np
my_df.apply(np.sum,axis=0)
# print(my_df.apply(np.sum,axis=1)) -- throws error TypeError: can only concatenate str (not "int") to str

name        Uday Vikram SinghAnubhav YadavPrakhar NigamAna...
age                                                       106
Degree      B.Tech(CSE)B.Tech(Chemical)B.Tech(Cyber Securi...
College     SRMCEMIETChandigarh UniversitySDCAIntegral Uni...
Location             LucknowLucknowChandigarhGhaziabadLucknow
dtype: object

In [107]:
# map()  - this function is used to map the values of the series according to input correspondence
age=my_df['age']
print(age)

age1=my_df['age'].map(lambda x:x*2)
print(age1)

a    20
b    21
c    21
d    23
e    21
Name: age, dtype: int64
a    40
b    42
c    42
d    46
e    42
Name: age, dtype: int64

In [108]:
degree=my_df['Degree'].map(lambda x: len(x))
print(degree)

a    11
b    16
c    22
d     6
e     7
Name: Degree, dtype: int64

In [109]:
name=my_df['name'].map(lambda x:x[::-1])
print(name)

a    hgniS markiV yadU
b        vadaY vahbunA
c        magiN rahkarP
d          ramuK dnanA
e          arhsiM ivaR
Name: name, dtype: object

In [110]:
# replace() - replace() replaces the specified value with another specified value
# it searches entire dataframe and replaces every case of specified value

In [111]:
my_df.replace('Uday Vikram Singh','Nikhil Singh')

,name,age,Degree,College,Location
a,Nikhil Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [112]:
my_df.replace('Prakhar Nigam','Honey')

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Honey,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [113]:
my_df.replace(['a','b','c','d','e'],[1,2,3,4,5])

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [114]:
# replacing an entire column using replace() and dictionary
# keys are old value and values are new values

new_age={20:21,21:22,23:24}
my_df.replace(new_age)

,name,age,Degree,College,Location
a,Uday Vikram Singh,21,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,22,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,22,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,24,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,22,Nursing,Integral University,Lucknow

In [115]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [116]:
# replacing an entire row 
new_row={'name':"Uday Vikram Singh Rajwar",'age':20,"Degree":"M.Tech","College":"BITS PILANI","Location":"Bangalore"}

idxs=my_df['name']=='Uday Vikram Singh'
idx=my_df.index[idxs][0]

# when dealing with labels(a,b,c,d...) use .loc[] and when dealing with positions(0,1,2,3..) use .iloc[]
my_df.loc[idx]=new_row
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh Rajwar,20,M.Tech,BITS PILANI,Bangalore
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow

In [117]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   age       5 non-null      int64
 2   Degree    5 non-null      object
 3   College   5 non-null      object
 4   Location  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 412.0+ bytes

In [118]:
my_df.describe()

             age
count   5.000000
mean   21.200000
std     1.095445
min    20.000000
25%    21.000000
50%    21.000000
75%    21.000000
max    23.000000

In [119]:
# astype() - convert datatype of columns
my_df.dtypes

name        object
age          int64
Degree      object
College     object
Location    object
dtype: object

In [120]:
my_df['age']=my_df['age'].astype(float)
my_df.dtypes

name         object
age         float64
Degree       object
College      object
Location     object
dtype: object

In [121]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh Rajwar,20.0,M.Tech,BITS PILANI,Bangalore
b,Anubhav Yadav,21.0,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21.0,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23.0,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21.0,Nursing,Integral University,Lucknow

In [122]:
my_df.dtypes

name         object
age         float64
Degree       object
College      object
Location     object
dtype: object

In [123]:
# concat() - Combine dataframes

new_details={
    'Location':['Lucknow','Lucknow','Chandigarh','Ghaziabad','Lucknow'],
    'percentage':[84.5,87.5,90.1,88.3,88.2]
}

df=pd.DataFrame(new_details)
df

     Location  percentage
0     Lucknow        84.5
1     Lucknow        87.5
2  Chandigarh        90.1
3   Ghaziabad        88.3
4     Lucknow        88.2

In [124]:
# by default axis=0 row-wise concatenation and axis=1 column wise concatenation
# Here , we are concatenate along columns , side by side , axis=1
concatenated_df = pd.concat([my_df,df], axis=1) 
concatenated_df

,name,age,Degree,College,Location,Location,percentage
a,Uday Vikram Singh Rajwar,20.0,M.Tech,BITS PILANI,Bangalore,NaN,NaN
b,Anubhav Yadav,21.0,B.Tech(Chemical),IET,Lucknow,NaN,NaN
c,Prakhar Nigam,21.0,B.Tech(Cyber Security),Chandigarh University,Chandigarh,NaN,NaN
d,Anand Kumar,23.0,B.Arch,SDCA,Ghaziabad,NaN,NaN
e,Ravi Mishra,21.0,Nursing,Integral University,Lucknow,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,Lucknow,84.5
1,NaN,NaN,NaN,NaN,NaN,Lucknow,87.5
2,NaN,NaN,NaN,NaN,NaN,Chandigarh,90.1
3,NaN,NaN,NaN,NaN,NaN,Ghaziabad,88.3
4,NaN,NaN,NaN,NaN,NaN,Lucknow,88.2

In [125]:
# merge() - Combining Dataframes
# merge() is typically used for combining dataframe based on common key column or index rather than 
# here we use join concept 
# use Location column to join

merged_df=pd.merge(my_df,df,on='Location',how='outer')
merged_df

,name,age,Degree,College,Location,percentage
0,Uday Vikram Singh Rajwar,20.0,M.Tech,BITS PILANI,Bangalore,NaN
1,Anubhav Yadav,21.0,B.Tech(Chemical),IET,Lucknow,84.5
2,Anubhav Yadav,21.0,B.Tech(Chemical),IET,Lucknow,87.5
3,Anubhav Yadav,21.0,B.Tech(Chemical),IET,Lucknow,88.2
4,Ravi Mishra,21.0,Nursing,Integral University,Lucknow,84.5
5,Ravi Mishra,21.0,Nursing,Integral University,Lucknow,87.5
6,Ravi Mishra,21.0,Nursing,Integral University,Lucknow,88.2
7,Prakhar Nigam,21.0,B.Tech(Cyber Security),Chandigarh University,Chandigarh,90.1
8,Anand Kumar,23.0,B.Arch,SDCA,Ghaziabad,88.3

# Data Aggregation and Grouping

In [126]:
# groupby() -  it is used to group data based on unique values in one or more columns. 
# It creates 'DataFrameGroupBy' Object which can be used to perform various operations on each group such as iteration, mean, max, applying custom functions
# It is splitted into 3 parts ie Splitting, Applying, Combining
# groupby() splits dataframe into groups based on the specified column(s), applies a function to each group independenlty, and then combines the result back into
# datafram or series.

group=my_df.groupby('name')

In [127]:
for name,g in group:
    print(name)
    print(g)
    print('\n')

Anand Kumar
          name   age  Degree College   Location
d  Anand Kumar  23.0  B.Arch    SDCA  Ghaziabad


Anubhav Yadav
            name   age            Degree College Location
b  Anubhav Yadav  21.0  B.Tech(Chemical)     IET  Lucknow


Prakhar Nigam
            name   age                  Degree                College
c  Prakhar Nigam  21.0  B.Tech(Cyber Security)  Chandigarh University  \

     Location
c  Chandigarh


Ravi Mishra
          name   age   Degree              College Location
e  Ravi Mishra  21.0  Nursing  Integral University  Lucknow


Uday Vikram Singh Rajwar
                       name   age  Degree      College   Location
a  Uday Vikram Singh Rajwar  20.0  M.Tech  BITS PILANI  Bangalore

In [128]:
mean_age=group['age'].mean()
print(mean_age)

name
Anand Kumar                 23.0
Anubhav Yadav               21.0
Prakhar Nigam               21.0
Ravi Mishra                 21.0
Uday Vikram Singh Rajwar    20.0
Name: age, dtype: float64

In [129]:
group1=my_df.groupby('Location')
group1['age'].mean()

Location
Bangalore     20.0
Chandigarh    21.0
Ghaziabad     23.0
Lucknow       21.0
Name: age, dtype: float64

In [130]:
group1['age'].max()

Location
Bangalore     20.0
Chandigarh    21.0
Ghaziabad     23.0
Lucknow       21.0
Name: age, dtype: float64

In [131]:
group1['age'].sum()

Location
Bangalore     20.0
Chandigarh    21.0
Ghaziabad     23.0
Lucknow       42.0
Name: age, dtype: float64

In [132]:
group1['age'].count()

Location
Bangalore     1
Chandigarh    1
Ghaziabad     1
Lucknow       2
Name: age, dtype: int64

In [133]:
# pivot_table()
# pivot table will be created based on the unique value present in index column
pivot=pd.pivot_table(my_df,values='age',index=['name','Location'])
print(pivot)

pivot1=pd.pivot_table(merged_df,values='percentage',index=['name'])
print(pivot1)

                                      age
name                     Location
Anand Kumar              Ghaziabad   23.0
Anubhav Yadav            Lucknow     21.0
Prakhar Nigam            Chandigarh  21.0
Ravi Mishra              Lucknow     21.0
Uday Vikram Singh Rajwar Bangalore   20.0
               percentage
name
Anand Kumar     88.300000
Anubhav Yadav   86.733333
Prakhar Nigam   90.100000
Ravi Mishra     86.733333